WELCOME_ADMIN = "👋 Привет, администратор автопроката <b>ТаксиСпринт</b>! 🚗\n\nЭтот бот поможет добавлять/удалять автомобили из списка, подтверждать бронирование пользователей и просматривать доступный пользователям функционал."
WELCOME_USER = "👋 Привет! Добро пожаловать в автопрокат <b>ТаксиСпринт</b>! 🚗\n\nЭтот бот поможет вам подобрать идеальный автомобиль для ваших потребностей и бюджета.\n\n✅ Бронируй с комфортом"
MENU_USER = "Чего бы вы хотели?"

SHOW_FLEET_COMMAND = "show_fleet"
MENU_COMMAND = "menu"
ALL_CARS_COMMAND = "show_all_cars"
ADD_CAR_COMMAND = "Добавить автомобиль"
DELETE_CAR_COMMAND = "Удалить автомобиль"
RENT_CAR_COMMAND = "Арендовать автомобиль"
AVAILABLE_CARS_COMMAND = "Доступные автомобили"
SHOW_RENTAL_TERMS_COMMAND = "show_rental_terms"  # Для условий аренды
SHOW_CONTACTS_COMMAND = "show_contacts"  # Для контактов

RENT_CAR_FORMAT_ERROR = "Используйте команду в формате: /rent_car <car_id> <start_time> <end_time>"
RENT_CAR_SUCCESS = "Аренда успешно оформлена."
RENT_CAR_UNAVAILABLE = "Автомобиль недоступен на выбранное время."
RENT_CAR_ERROR = "Ошибка при аренде автомобиля: {error}"

NO_AVAILABLE_CARS = "Нет доступных автомобилей."

NO_CARS = "Нет добавленных автомобилей."

ADD_CAR_FORMAT_ERROR = "Используйте команду в формате: /add_car <brand> <model> <class> <photo_urls>"
ADD_CAR_SUCCESS = "Автомобиль {brand} {model} добавлен в класс {car_class}."
ADD_CAR_ERROR = "Ошибка при добавлении автомобиля: {error}"